Stats/Consolidation/Native/disk_8.log
/dev/sdb: (g=0): rw=randrw, bs=256K-256K/256K-256K/256K-256K, ioengine=libaio, iodepth=12
fio-2.2.8
Starting 1 process

/dev/sdb: (groupid=0, jobs=1): err= 0: pid=6125: Sun Feb 21 20:22:51 2016
  read : io=7229.8MB, bw=30493KB/s, iops=119, runt=242782msec
    slat (usec): min=19, max=110, avg=23.07, stdev= 4.10
    clat (msec): min=1, max=1524, avg=29.02, stdev=58.92
     lat (msec): min=1, max=1524, avg=29.04, stdev=58.92
    clat percentiles (msec):
     |  1.00th=[    3],  5.00th=[    4], 10.00th=[    6], 20.00th=[   10],
     | 30.00th=[   13], 40.00th=[   17], 50.00th=[   20], 60.00th=[   23],
     | 70.00th=[   29], 80.00th=[   38], 90.00th=[   53], 95.00th=[   73],
     | 99.00th=[  180], 99.50th=[  310], 99.90th=[  963], 99.95th=[ 1516],
     | 99.99th=[ 1516]
    bw (KB  /s): min=18358, max=49367, per=100.00%, avg=30545.33, stdev=4694.40
  write: io=7226.3MB, bw=30479KB/s, iops=119, runt=242782msec
    slat (usec): min=19, max=109, avg=29.38, stdev= 5.73
    clat (msec): min=1, max=230, avg=71.70, stdev=25.34
     lat (msec): min=1, max=230, avg=71.73, stdev=25.34
    clat percentiles (msec):
     |  1.00th=[   17],  5.00th=[   34], 10.00th=[   42], 20.00th=[   52],
     | 30.00th=[   59], 40.00th=[   65], 50.00th=[   71], 60.00th=[   77],
     | 70.00th=[   83], 80.00th=[   92], 90.00th=[  104], 95.00th=[  116],
     | 99.00th=[  143], 99.50th=[  153], 99.90th=[  178], 99.95th=[  192],
     | 99.99th=[  206]
    bw (KB  /s): min=16896, max=47616, per=100.00%, avg=30517.12, stdev=4885.90
    lat (msec) : 2=0.03%, 4=2.63%, 10=8.33%, 20=16.43%, 50=26.12%
    lat (msec) : 100=39.00%, 250=7.14%, 500=0.22%, 750=0.04%, 1000=0.02%
    lat (msec) : 2000=0.04%
  cpu          : usr=0.23%, sys=0.66%, ctx=58010, majf=0, minf=7051
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=100.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=28919/w=28905/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=12

Run status group 0 (all jobs):
   READ: io=7229.8MB, aggrb=30493KB/s, minb=30493KB/s, maxb=30493KB/s, mint=242782msec, maxt=242782msec
  WRITE: io=7226.3MB, aggrb=30478KB/s, minb=30478KB/s, maxb=30478KB/s, mint=242782msec, maxt=242782msec

Disk stats (read/write):
  sdb: ios=28998/28883, merge=0/0, ticks=838526/2069283, in_queue=2908283, util=100.00%