Stats/Consolidation/Native/mmap_0.log
file1: (g=0): rw=randrw, bs=256K-256K/256K-256K/256K-256K, ioengine=mmap, iodepth=4
file2: (g=0): rw=randrw, bs=256K-256K/256K-256K/256K-256K, ioengine=mmap, iodepth=32
file3: (g=0): rw=randrw, bs=256K-256K/256K-256K/256K-256K, ioengine=mmap, iodepth=8
file4: (g=0): rw=randrw, bs=256K-256K/256K-256K/256K-256K, ioengine=mmap, iodepth=16
fio-2.2.8
Starting 4 processes
file1: Laying out IO file(s) (1 file(s) / 512MB)
file2: Laying out IO file(s) (1 file(s) / 512MB)
file3: Laying out IO file(s) (1 file(s) / 512MB)
file4: Laying out IO file(s) (1 file(s) / 512MB)

file1: (groupid=0, jobs=1): err= 0: pid=4442: Sun Feb 21 19:51:13 2016
  read : io=270848KB, bw=978.89KB/s, iops=3, runt=276696msec
    clat (msec): min=4, max=307, avg=133.89, stdev=57.83
     lat (msec): min=4, max=307, avg=133.89, stdev=57.83
    clat percentiles (msec):
     |  1.00th=[   25],  5.00th=[   46], 10.00th=[   58], 20.00th=[   80],
     | 30.00th=[  102], 40.00th=[  120], 50.00th=[  135], 60.00th=[  147],
     | 70.00th=[  161], 80.00th=[  180], 90.00th=[  208], 95.00th=[  239],
     | 99.00th=[  285], 99.50th=[  293], 99.90th=[  302], 99.95th=[  310],
     | 99.99th=[  310]
    bw (KB  /s): min=  332, max= 3586, per=26.19%, avg=1025.40, stdev=472.99
  write: io=253440KB, bw=937933B/s, iops=3, runt=276696msec
    clat (msec): min=9, max=342, avg=136.38, stdev=57.40
     lat (msec): min=9, max=342, avg=136.38, stdev=57.40
    clat percentiles (msec):
     |  1.00th=[   27],  5.00th=[   49], 10.00th=[   59], 20.00th=[   85],
     | 30.00th=[  104], 40.00th=[  122], 50.00th=[  137], 60.00th=[  149],
     | 70.00th=[  163], 80.00th=[  180], 90.00th=[  210], 95.00th=[  237],
     | 99.00th=[  293], 99.50th=[  314], 99.90th=[  343], 99.95th=[  343],
     | 99.99th=[  343]
    bw (KB  /s): min=  346, max= 2222, per=26.76%, avg=980.29, stdev=409.66
    lat (msec) : 10=0.15%, 20=0.39%, 50=5.81%, 100=21.34%, 250=68.80%
    lat (msec) : 500=3.52%
  cpu          : usr=0.08%, sys=0.69%, ctx=137073, majf=131072, minf=89
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=1058/w=990/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=4
file2: (groupid=0, jobs=1): err= 0: pid=4443: Sun Feb 21 19:51:13 2016
  read : io=270848KB, bw=982.31KB/s, iops=3, runt=275804msec
    clat (msec): min=12, max=310, avg=131.42, stdev=56.15
     lat (msec): min=12, max=310, avg=131.42, stdev=56.15
    clat percentiles (msec):
     |  1.00th=[   32],  5.00th=[   46], 10.00th=[   58], 20.00th=[   77],
     | 30.00th=[   98], 40.00th=[  116], 50.00th=[  131], 60.00th=[  147],
     | 70.00th=[  161], 80.00th=[  180], 90.00th=[  206], 95.00th=[  227],
     | 99.00th=[  265], 99.50th=[  281], 99.90th=[  310], 99.95th=[  310],
     | 99.99th=[  310]
    bw (KB  /s): min=  365, max= 2948, per=26.46%, avg=1035.95, stdev=490.94
  write: io=253440KB, bw=940967B/s, iops=3, runt=275804msec
    clat (msec): min=18, max=402, avg=138.14, stdev=55.52
     lat (msec): min=18, max=402, avg=138.14, stdev=55.52
    clat percentiles (msec):
     |  1.00th=[   32],  5.00th=[   52], 10.00th=[   62], 20.00th=[   86],
     | 30.00th=[  109], 40.00th=[  124], 50.00th=[  137], 60.00th=[  151],
     | 70.00th=[  169], 80.00th=[  186], 90.00th=[  208], 95.00th=[  233],
     | 99.00th=[  269], 99.50th=[  302], 99.90th=[  404], 99.95th=[  404],
     | 99.99th=[  404]
    bw (KB  /s): min=  368, max= 2365, per=26.48%, avg=969.97, stdev=420.38
    lat (msec) : 20=0.15%, 50=5.42%, 100=23.49%, 250=68.46%, 500=2.49%
  cpu          : usr=0.08%, sys=0.70%, ctx=137454, majf=131072, minf=495
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=1058/w=990/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=32
file3: (groupid=0, jobs=1): err= 0: pid=4444: Sun Feb 21 19:51:13 2016
  read : io=270848KB, bw=980.34KB/s, iops=3, runt=276282msec
    clat (msec): min=22, max=323, avg=133.89, stdev=55.41
     lat (msec): min=22, max=323, avg=133.89, stdev=55.41
    clat percentiles (msec):
     |  1.00th=[   30],  5.00th=[   45], 10.00th=[   59], 20.00th=[   83],
     | 30.00th=[  103], 40.00th=[  122], 50.00th=[  135], 60.00th=[  149],
     | 70.00th=[  163], 80.00th=[  180], 90.00th=[  204], 95.00th=[  229],
     | 99.00th=[  269], 99.50th=[  281], 99.90th=[  297], 99.95th=[  322],
     | 99.99th=[  322]
    bw (KB  /s): min=  341, max= 3149, per=26.27%, avg=1028.55, stdev=485.63
  write: io=253440KB, bw=939339B/s, iops=3, runt=276282msec
    clat (msec): min=17, max=326, avg=135.98, stdev=56.06
     lat (msec): min=18, max=326, avg=135.98, stdev=56.06
    clat percentiles (msec):
     |  1.00th=[   29],  5.00th=[   50], 10.00th=[   60], 20.00th=[   84],
     | 30.00th=[  102], 40.00th=[  122], 50.00th=[  137], 60.00th=[  151],
     | 70.00th=[  167], 80.00th=[  184], 90.00th=[  206], 95.00th=[  233],
     | 99.00th=[  269], 99.50th=[  293], 99.90th=[  326], 99.95th=[  326],
     | 99.99th=[  326]
    bw (KB  /s): min=  341, max= 2757, per=26.88%, avg=984.65, stdev=433.39
    lat (msec) : 20=0.20%, 50=6.15%, 100=22.31%, 250=68.75%, 500=2.59%
  cpu          : usr=0.08%, sys=0.70%, ctx=137473, majf=131072, minf=543
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=1058/w=990/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=8
file4: (groupid=0, jobs=1): err= 0: pid=4445: Sun Feb 21 19:51:13 2016
  read : io=270848KB, bw=979.31KB/s, iops=3, runt=276573msec
    clat (msec): min=6, max=311, avg=132.66, stdev=57.37
     lat (msec): min=6, max=311, avg=132.66, stdev=57.37
    clat percentiles (msec):
     |  1.00th=[   29],  5.00th=[   45], 10.00th=[   55], 20.00th=[   78],
     | 30.00th=[  101], 40.00th=[  117], 50.00th=[  130], 60.00th=[  147],
     | 70.00th=[  163], 80.00th=[  182], 90.00th=[  208], 95.00th=[  233],
     | 99.00th=[  269], 99.50th=[  285], 99.90th=[  310], 99.95th=[  310],
     | 99.99th=[  310]
    bw (KB  /s): min=  339, max= 3534, per=26.30%, avg=1029.61, stdev=465.95
  write: io=253440KB, bw=938351B/s, iops=3, runt=276573msec
    clat (msec): min=18, max=383, avg=137.57, stdev=57.94
     lat (msec): min=18, max=383, avg=137.57, stdev=57.94
    clat percentiles (msec):
     |  1.00th=[   25],  5.00th=[   50], 10.00th=[   62], 20.00th=[   87],
     | 30.00th=[  103], 40.00th=[  121], 50.00th=[  135], 60.00th=[  153],
     | 70.00th=[  167], 80.00th=[  186], 90.00th=[  210], 95.00th=[  239],
     | 99.00th=[  293], 99.50th=[  306], 99.90th=[  383], 99.95th=[  383],
     | 99.99th=[  383]
    bw (KB  /s): min=  339, max= 2690, per=26.73%, avg=979.08, stdev=427.29
    lat (msec) : 10=0.05%, 20=0.15%, 50=6.25%, 100=22.51%, 250=67.77%
    lat (msec) : 500=3.27%
  cpu          : usr=0.07%, sys=0.70%, ctx=137455, majf=131072, minf=487
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=1058/w=990/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=16

Run status group 0 (all jobs):
   READ: io=1058.0MB, aggrb=3915KB/s, minb=978KB/s, maxb=982KB/s, mint=275804msec, maxt=276696msec
  WRITE: io=990.0MB, aggrb=3663KB/s, minb=915KB/s, maxb=918KB/s, mint=275804msec, maxt=276696msec

Disk stats (read/write):
    dm-2: ios=523441/12219, merge=0/0, ticks=911392/187050, in_queue=1098455, util=100.00%, aggrios=524288/12450, aggrmerge=0/13, aggrticks=912036/187440, aggrin_queue=1099332, aggrutil=100.00%
  sda: ios=524288/12450, merge=0/13, ticks=912036/187440, in_queue=1099332, util=100.00%